---
kind: property
id: P:Autodesk.Revit.DB.AlphanumericRevisionSettings.Prefix
source: html/bb8129ba-3ba4-43e0-b900-1d92a9d59618.htm
---
# Autodesk.Revit.DB.AlphanumericRevisionSettings.Prefix Property

The prefix string that will be prepended to the number of each revision with Alphanumeric RevisionNumberingType.

## Syntax (C#)
```csharp
public string Prefix { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null